galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F479/cpu_reg/stm32F479_usb.h
/*
; stm32F429_usb.
; ==============

;------------------------------------------------------------------------
; Author:	Franzi Edo.	The 2006-06-28
; Modifs:
;
; SVN:
; $Author:: efr               $:  Author of last commit
; $Rev:: 113                  $:  Revision of last commit
; $Date:: 2017-04-16 16:55:48#$:  Date of last commit
;
; Project:	uKOS
; Goal:		stm32F429_usb equates.
;
;   (c) 1992-2017, Franzi Edo.
;   --------------------------
;                                              __ ______  _____
;   Franzi Edo.                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   This program is free software: you can redistribute it and/or modify
;   it under the terms of the GNU Affero General Public License as published by
;   the Free Software Foundation, either version 3 of the License, or
;   (at your option) any later version.
;
;   This program is distributed in the hope that it will be useful,
;   but WITHOUT ANY WARRANTY; without even the implied warranty of
;   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
;   GNU Affero General Public License for more details.
;
;   You should have received a copy of the GNU Affero General Public License
;   along with this program. If not, see <http://www.gnu.org/licenses/>.
;
;------------------------------------------------------------------------
*/

#ifndef __STM32F429_USB__
#define __STM32F429_USB__

#define	USB_OTG_GLOBAL_BASE			0x000			//
#define	USB_OTG_DEVICE_BASE			0x800			//
#define	USB_OTG_IN_ENDPOINT_BASE	0x900			//
#define	USB_OTG_OUT_ENDPOINT_BASE	0xB00			//
#define	USB_OTG_EP_REG_SIZE			0x20			//
#define	USB_OTG_HOST_BASE			0x400			//
#define	USB_OTG_HOST_PORT_BASE		0x440			//
#define	USB_OTG_HOST_CHANNEL_BASE	0x500			//
#define	USB_OTG_HOST_CHANNEL_SIZE	0x20			//
#define	USB_OTG_PCGCCTL_BASE		0xE00			//
#define	USB_OTG_FIFO_BASE			0x1000			//
#define	USB_OTG_FIFO_SIZE			0x1000			// USB OTG base address

// USB_OTG_Core address definitions
// --------------------------------

typedef struct {
	volatile	uint32_t	GOTGCTL;				// USB_OTG Control and Status Register       0x00
	volatile	uint32_t	GOTGINT;				// USB_OTG Interrupt Register                0x04
	volatile	uint32_t	GAHBCFG;				// Core AHB Configuration Register           0x08
	volatile	uint32_t	GUSBCFG;				// Core USB Configuration Register           0x0C
	volatile	uint32_t	GRSTCTL;				// Core Reset Register                       0x10
	volatile	uint32_t	GINTSTS;				// Core Interrupt Register                   0x14
	volatile	uint32_t	GINTMSK;				// Core Interrupt Mask Register              0x18
	volatile	uint32_t	GRXSTSR;				// Receive Sts Q Read Register               0x1C
	volatile	uint32_t	GRXSTSP;				// Receive Sts Q Read & POP Register         0x20
	volatile	int32_t		GRXFSIZ;				// Receive FIFO Size Register                0x24
	volatile	uint32_t	DIEPTXF0_HNPTXFSIZ;		// EP0 / Non Periodic Tx FIFO Size Register  0x28
	volatile	uint32_t	HNPTXSTS;				// Non Periodic Tx FIFO/Queue Sts reg        0x2C
	volatile	uint32_t	Reserved30[2];			// Reserved                                  0x30
	volatile	uint32_t	GCCFG;					// General Purpose IO Register               0x38
	volatile	uint32_t	CID;					// User ID Register                          0x3C
	volatile	uint32_t	Reserved40[48];			// Reserved                                  0x40-0xFF
	volatile	uint32_t	HPTXFSIZ;				// Host Periodic Tx FIFO Size Reg            0x100
	volatile	uint32_t	DIEPTXF[0x0F];			// Dev Periodic Transmit FIFO
} USB_OTG_GlobalTypeDef;

// device_Registers address definitions
// ------------------------------------

typedef struct  {
	volatile	uint32_t	DCFG;					// Dev Configuration Register   			 0x800
	volatile	uint32_t	DCTL;					// Dev Control Register         			 0x804
	volatile	uint32_t	DSTS;					// Dev Status Register (RO)     			 0x808
	volatile	uint32_t	Reserved0C;				// Reserved                     			 0x80C
	volatile	uint32_t	DIEPMSK;				// Dev IN Endpoint Mask         			 0x810
	volatile	uint32_t	DOEPMSK;				// Dev OUT Endpoint Mask        			 0x814
	volatile	uint32_t	DAINT;					// Dev All Endpoints Itr Reg    			 0x818
	volatile	uint32_t	DAINTMSK;				// Dev All Endpoints Itr Mask   			 0x81C
	volatile	uint32_t	Reserved20;				// Reserved                     			 0x820
	volatile	uint32_t	Reserved9;				// Reserved                     			 0x824
	volatile	uint32_t	DVBUSDIS;				// Dev VBUS discharge Register  			 0x828
	volatile	uint32_t	DVBUSPULSE;				// Dev VBUS Pulse Register      			 0x82C
	volatile	uint32_t	DTHRCTL;				// Dev thr                      			 0x830
	volatile	uint32_t	DIEPEMPMSK;				// Dev empty msk             				 0x834
	volatile	uint32_t	DEACHINT;				// Dedicated EP interrupt       			 0x838
	volatile	uint32_t	DEACHMSK;				// Dedicated EP msk             			 0x83C
	volatile	uint32_t	Reserved40;				// Dedicated EP mask           				 0x840
	volatile	uint32_t	DINEP1MSK;				// Dedicated EP mask           				 0x844
	volatile	uint32_t	Reserved44[15];			// Reserved                 				 0x844-0x87C
	volatile	uint32_t	DOUTEP1MSK;				// dedicated EP msk            				 0x884
} USB_OTG_DeviceTypeDef;

// IN_Endpoint-Specific_Register address definitions
// -------------------------------------------------

typedef struct  {
	volatile	uint32_t	DIEPCTL;				// Dev IN Endpoint Control Reg               0x900 + (ep_num * 0x20) + 0x00
	volatile	uint32_t	Reserved04;				// Reserved                                  0x900 + (ep_num * 0x20) + 0x04
	volatile	uint32_t	DIEPINT;				// Dev IN Endpoint Itr Reg                   0x900 + (ep_num * 0x20) + 0x08
	volatile	uint32_t	Reserved0C;				// Reserved                                  0x900 + (ep_num * 0x20) + 0x0C
	volatile	uint32_t	DIEPTSIZ;				// IN Endpoint Txfer Size                    0x900 + (ep_num * 0x20) + 0x10
	volatile	uint32_t	DIEPDMA;				// IN Endpoint DMA Address Reg               0x900 + (ep_num * 0x20) + 0x14
	volatile	uint32_t	DTXFSTS;				// IN Endpoint Tx FIFO Status Reg            0x900 + (ep_num * 0x20) + 0x18
	volatile	uint32_t	Reserved18;				// Reserved 0x900 + (ep_num * 0x20) + 0x1C - 0x900 + (ep_num * 0x20) + 0x1C
} USB_OTG_INEndpointTypeDef;

