galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F479/cpu_reg/stm32F479_usb.h
// OUT_Endpoint-Specific_Registers address definitions
// ---------------------------------------------------

typedef struct  {
	volatile	uint32_t	DOEPCTL;				// Dev OUT Endpoint Control Reg              0xB00 + (ep_num * 0x20) + 0x00
	volatile	uint32_t	Reserved04;				// Reserved                                  0xB00 + (ep_num * 0x20) + 0x04
	volatile	uint32_t	DOEPINT;				// Dev OUT Endpoint Itr Reg                  0xB00 + (ep_num * 0x20) + 0x08
	volatile	uint32_t	Reserved0C;				// Reserved                                  0xB00 + (ep_num * 0x20) + 0x0C
	volatile	uint32_t	DOEPTSIZ;				// Dev OUT Endpoint Txfer Size               0xB00 + (ep_num * 0x20) + 0x10
	volatile	uint32_t	DOEPDMA;				// Dev OUT Endpoint DMA Address              0xB00 + (ep_num * 0x20) + 0x14
	volatile	uint32_t	Reserved18[2];			// Reserved 0xB00 + (ep_num * 0x20) + 0x18 - 0xB00 + (ep_num * 0x20) + 0x1C
} USB_OTG_OUTEndpointTypeDef;

// Host_Mode_Register_Structures address definitions
// -------------------------------------------------

typedef struct  {
	volatile	uint32_t	HCFG;					// Host Configuration Register          	 0x400
	volatile	uint32_t	HFIR;					// Host Frame Interval Register         	 0x404
	volatile	uint32_t	HFNUM;					// Host Frame Nbr/Frame Remaining       	 0x408
	volatile	uint32_t	Reserved40C;			// Reserved                             	 0x40C
	volatile	uint32_t	HPTXSTS;				// Host Periodic Tx FIFO/ Queue Status  	 0x410
	volatile	uint32_t	HAINT;					// Host All Channels Interrupt Register 	 0x414
	volatile	uint32_t	HAINTMSK;				// Host All Channels Interrupt Mask     	 0x418
} USB_OTG_HostTypeDef;

// Host_Channel_Specific_Registers address definitions
// ---------------------------------------------------

typedef struct {
	volatile	uint32_t	HCCHAR;					//
	volatile	uint32_t	HCSPLT;					//
	volatile	uint32_t	HCINT;					//
	volatile	uint32_t	HCINTMSK;				//
	volatile	uint32_t	HCTSIZ;					//
	volatile	uint32_t	HCDMA;					//
	volatile	uint32_t	Reserved[2];			//
} USB_OTG_HostChannelTypeDef;

#define	USB_OTG_FS		((USB_OTG_GlobalTypeDef *)      USB_OTG_FS_PERIPH_BASE)
#define	USB_OTG_HS		((USB_OTG_GlobalTypeDef *)      USB_OTG_HS_PERIPH_BASE)

#define USBx 			USB_OTG_FS_PERIPH_BASE
#define USBx_DEVICE     ((USB_OTG_DeviceTypeDef *)      ((uint32_t)USBx + USB_OTG_DEVICE_BASE)) 
#define USBx_INEP(i)    ((USB_OTG_INEndpointTypeDef *)  ((uint32_t)USBx + USB_OTG_IN_ENDPOINT_BASE  + (i)*USB_OTG_EP_REG_SIZE))        
#define USBx_OUTEP(i)   ((USB_OTG_OUTEndpointTypeDef *) ((uint32_t)USBx + USB_OTG_OUT_ENDPOINT_BASE + (i)*USB_OTG_EP_REG_SIZE))        
#define USBx_DFIFO(i)   *(volatile uint32_t *)          ((uint32_t)USBx + USB_OTG_FIFO_BASE         + (i)*USB_OTG_FIFO_SIZE)
#define USBx_HOST       ((USB_OTG_HostTypeDef *)        ((uint32_t)USBx + USB_OTG_HOST_BASE))  
#define USBx_HC(i)      ((USB_OTG_HostChannelTypeDef *) ((uint32_t)USBx + USB_OTG_HOST_CHANNEL_BASE + (i)*USB_OTG_HOST_CHANNEL_SIZE))
#define USBx_PCGCR		*(volatile uint32_t *)          ((uint32_t)USBx + USB_OTG_PCGCCTL_BASE)

// USB_OTG_GOTGCTL register

#define	USB_OTG_GOTGCTL_SRQSCS					0x00000001		//
#define	USB_OTG_GOTGCTL_SRQ						0x00000002		//
#define	USB_OTG_GOTGCTL_HNGSCS					0x00000100		//
#define	USB_OTG_GOTGCTL_HNPRQ					0x00000200		//
#define	USB_OTG_GOTGCTL_HSHNPEN					0x00000400		//
#define	USB_OTG_GOTGCTL_DHNPEN					0x00000800		//
#define	USB_OTG_GOTGCTL_CIDSTS					0x00010000		//
#define	USB_OTG_GOTGCTL_DBCT					0x00020000		//
#define	USB_OTG_GOTGCTL_ASVLD					0x00040000		//
#define	USB_OTG_GOTGCTL_BSVLD					0x00080000		//

// USB_OTG_HCFG register

#define	USB_OTG_HCFG_FSLSPCS					0x00000003		//
#define	USB_OTG_HCFG_FSLSPCS_0					0x00000001		//
#define	USB_OTG_HCFG_FSLSPCS_1					0x00000002		//
#define	USB_OTG_HCFG_FSLSS 						0x00000004		//
	
// USB_OTG_DCFG register	
	
#define	USB_OTG_DCFG_DSPD  						0x00000003		//
#define	USB_OTG_DCFG_DSPD_0						0x00000001		//
#define	USB_OTG_DCFG_DSPD_1						0x00000002		//
#define	USB_OTG_DCFG_NZLSOHSK 					0x00000004		//
#define	USB_OTG_DCFG_DAD   						0x000007F0		//
#define	USB_OTG_DCFG_DAD_0 						0x00000010		//
#define	USB_OTG_DCFG_DAD_1 						0x00000020		//
#define	USB_OTG_DCFG_DAD_2 						0x00000040		//
#define	USB_OTG_DCFG_DAD_3 						0x00000080		//
#define	USB_OTG_DCFG_DAD_4 						0x00000100		//
#define	USB_OTG_DCFG_DAD_5 						0x00000200		//
#define	USB_OTG_DCFG_DAD_6 						0x00000400		//
#define	USB_OTG_DCFG_PFIVL 						0x00001800		//
#define	USB_OTG_DCFG_PFIVL_0					0x00000800		//
#define	USB_OTG_DCFG_PFIVL_1					0x00001000		//
#define	USB_OTG_DCFG_PERSCHIVL					0x03000000		//
#define	USB_OTG_DCFG_PERSCHIVL_0    			0x01000000		//
#define	USB_OTG_DCFG_PERSCHIVL_1    			0x02000000		//

// USB_OTG_PCGCR register

#define	USB_OTG_PCGCR_STPPCLK					0x00000001		//
#define	USB_OTG_PCGCR_GATEHCLK 					0x00000002		//
#define	USB_OTG_PCGCR_PHYSUSP					0x00000010		//

// USB_OTG_GOTGINT register

#define	USB_OTG_GOTGINT_SEDET 					0x00000004		//
#define	USB_OTG_GOTGINT_SRSSCHG					0x00000100		//
#define	USB_OTG_GOTGINT_HNSSCHG					0x00000200		//
#define	USB_OTG_GOTGINT_HNGDET					0x00020000		//
#define	USB_OTG_GOTGINT_ADTOCHG					0x00040000		//
#define	USB_OTG_GOTGINT_DBCDNE					0x00080000		//

// USB_OTG_DCTL register

#define	USB_OTG_DCTL_RWUSIG						0x00000001		//
#define	USB_OTG_DCTL_SDIS  						0x00000002		//
#define	USB_OTG_DCTL_GINSTS						0x00000004		//
#define	USB_OTG_DCTL_GONSTS						0x00000008		//
#define	USB_OTG_DCTL_TCTL  						0x00000070		//
#define	USB_OTG_DCTL_TCTL_0						0x00000010		//
#define	USB_OTG_DCTL_TCTL_1						0x00000020		//
#define	USB_OTG_DCTL_TCTL_2						0x00000040		//
#define	USB_OTG_DCTL_SGINAK						0x00000080		//
#define	USB_OTG_DCTL_CGINAK						0x00000100		//
#define	USB_OTG_DCTL_SGONAK						0x00000200		//
#define	USB_OTG_DCTL_CGONAK						0x00000400		//
#define	USB_OTG_DCTL_POPRGDNE 					0x00000800		//
	
// USB_OTG_HFIR register	
	
#define	USB_OTG_HFIR_FRIVL 						0x0000FFFF		//

// USB_OTG_HFNUM register

#define	USB_OTG_HFNUM_FRNUM 					0x0000FFFF		//
#define	USB_OTG_HFNUM_FTREM 					0xFFFF0000		//

