galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F479/cpu_reg/stm32F479_usb.h
// USB_OTG_DSTS register

#define	USB_OTG_DSTS_SUSPSTS					0x00000001		//
#define	USB_OTG_DSTS_ENUMSPD					0x00000006		//
#define	USB_OTG_DSTS_ENUMSPD_0					0x00000002		//
#define	USB_OTG_DSTS_ENUMSPD_1					0x00000004		//
#define	USB_OTG_DSTS_EERR  						0x00000008		//
#define	USB_OTG_DSTS_FNSOF 						0x003FFF00		//

// USB_OTG_GAHBCFG register

#define	USB_OTG_GAHBCFG_GINT  					0x00000001		//
#define	USB_OTG_GAHBCFG_HBSTLEN					0x0000001E		//
#define	USB_OTG_GAHBCFG_HBSTLEN_0				0x00000002		//
#define	USB_OTG_GAHBCFG_HBSTLEN_1				0x00000004		//
#define	USB_OTG_GAHBCFG_HBSTLEN_2				0x00000008		//
#define	USB_OTG_GAHBCFG_HBSTLEN_3				0x00000010		//
#define	USB_OTG_GAHBCFG_DMAEN 					0x00000020		//
#define	USB_OTG_GAHBCFG_TXFELVL					0x00000080		//
#define	USB_OTG_GAHBCFG_PTXFELVL 				0x00000100		//

// USB_OTG_GUSBCFG register

#define	USB_OTG_GUSBCFG_TOCAL 					0x00000007		//
#define	USB_OTG_GUSBCFG_TOCAL_0					0x00000001		//
#define	USB_OTG_GUSBCFG_TOCAL_1					0x00000002		//
#define	USB_OTG_GUSBCFG_TOCAL_2					0x00000004		//
#define	USB_OTG_GUSBCFG_PHYSEL					0x00000040		//
#define	USB_OTG_GUSBCFG_SRPCAP					0x00000100		//
#define	USB_OTG_GUSBCFG_HNPCAP					0x00000200		//
#define	USB_OTG_GUSBCFG_TRDT  					0x00003C00		//
#define	USB_OTG_GUSBCFG_TRDT_0					0x00000400		//
#define	USB_OTG_GUSBCFG_TRDT_1					0x00000800		//
#define	USB_OTG_GUSBCFG_TRDT_2					0x00001000		//
#define	USB_OTG_GUSBCFG_TRDT_3					0x00002000		//
#define	USB_OTG_GUSBCFG_PHYLPCS					0x00008000		//
#define	USB_OTG_GUSBCFG_ULPIFSLS 				0x00020000		//
#define	USB_OTG_GUSBCFG_ULPIAR					0x00040000		//
#define	USB_OTG_GUSBCFG_ULPICSM					0x00080000		//
#define	USB_OTG_GUSBCFG_ULPIEVBUSD     			0x00100000		//
#define	USB_OTG_GUSBCFG_ULPIEVBUSI     			0x00200000		//
#define	USB_OTG_GUSBCFG_TSDPS 					0x00400000		//
#define	USB_OTG_GUSBCFG_PCCI  					0x00800000		//
#define	USB_OTG_GUSBCFG_PTCI  					0x01000000		//
#define	USB_OTG_GUSBCFG_ULPIIPD					0x02000000		//
#define	USB_OTG_GUSBCFG_FHMOD 					0x20000000		//
#define	USB_OTG_GUSBCFG_FDMOD 					0x40000000		//
#define	USB_OTG_GUSBCFG_CTXPKT					0x80000000		//

// USB_OTG_GRSTCTL register

#define	USB_OTG_GRSTCTL_CSRST 					0x00000001		//
#define	USB_OTG_GRSTCTL_HSRST 					0x00000002		//
#define	USB_OTG_GRSTCTL_FCRST 					0x00000004		//
#define	USB_OTG_GRSTCTL_RXFFLSH					0x00000010		//
#define	USB_OTG_GRSTCTL_TXFFLSH					0x00000020		//
#define	USB_OTG_GRSTCTL_TXFNUM					0x000007C0		//
#define	USB_OTG_GRSTCTL_TXFNUM_0 				0x00000040		//
#define	USB_OTG_GRSTCTL_TXFNUM_1 				0x00000080		//
#define	USB_OTG_GRSTCTL_TXFNUM_2 				0x00000100		//
#define	USB_OTG_GRSTCTL_TXFNUM_3 				0x00000200		//
#define	USB_OTG_GRSTCTL_TXFNUM_4 				0x00000400		//
#define	USB_OTG_GRSTCTL_DMAREQ					0x40000000		//
#define	USB_OTG_GRSTCTL_AHBIDL					0x80000000		//

// USB_OTG_DIEPMSK register

#define	USB_OTG_DIEPMSK_XFRCM 					0x00000001		//
#define	USB_OTG_DIEPMSK_EPDM  					0x00000002		//
#define	USB_OTG_DIEPMSK_TOM   					0x00000008		//
#define	USB_OTG_DIEPMSK_ITTXFEMSK				0x00000010		//
#define	USB_OTG_DIEPMSK_INEPNMM					0x00000020		//
#define	USB_OTG_DIEPMSK_INEPNEM					0x00000040		//
#define	USB_OTG_DIEPMSK_TXFURM					0x00000100		//
#define	USB_OTG_DIEPMSK_BIM   					0x00000200		//

// USB_OTG_HPTXSTS register

#define	USB_OTG_HPTXSTS_PTXFSAVL 				0x0000FFFF		//
#define	USB_OTG_HPTXSTS_PTXQSAV					0x00FF0000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_0				0x00010000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_1				0x00020000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_2				0x00040000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_3				0x00080000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_4				0x00100000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_5				0x00200000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_6				0x00400000		//
#define	USB_OTG_HPTXSTS_PTXQSAV_7				0x00800000		//
#define	USB_OTG_HPTXSTS_PTXQTOP					0xFF000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_0				0x01000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_1				0x02000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_2				0x04000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_3				0x08000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_4				0x10000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_5				0x20000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_6				0x40000000		//
#define	USB_OTG_HPTXSTS_PTXQTOP_7				0x80000000		//

// USB_OTG_HAINT register

#define	USB_OTG_HAINT_HAINT 					0x0000FFFF		//

// USB_OTG_DOEPMSK register

#define	USB_OTG_DOEPMSK_XFRCM 					0x00000001		//
#define	USB_OTG_DOEPMSK_EPDM  					0x00000002		//
#define	USB_OTG_DOEPMSK_STUPM 					0x00000008		//
#define	USB_OTG_DOEPMSK_OTEPDM					0x00000010		//
#define	USB_OTG_DOEPMSK_B2BSTUP					0x00000040		//
#define	USB_OTG_DOEPMSK_OPEM  					0x00000100		//
#define	USB_OTG_DOEPMSK_BOIM  					0x00000200		//

// USB_OTG_GINTSTS register

#define	USB_OTG_GINTSTS_CMOD  					0x00000001		//
#define	USB_OTG_GINTSTS_MMIS  					0x00000002		//
#define	USB_OTG_GINTSTS_OTGINT					0x00000004		//
#define	USB_OTG_GINTSTS_SOF   					0x00000008		//
#define	USB_OTG_GINTSTS_RXFLVL					0x00000010		//
#define	USB_OTG_GINTSTS_NPTXFE					0x00000020		//
#define	USB_OTG_GINTSTS_GINAKEFF 				0x00000040		//
#define	USB_OTG_GINTSTS_BOUTNAKEFF     			0x00000080		//
#define	USB_OTG_GINTSTS_ESUSP 					0x00000400		//
#define	USB_OTG_GINTSTS_USBSUSP					0x00000800		//
#define	USB_OTG_GINTSTS_USBRST					0x00001000		//
#define	USB_OTG_GINTSTS_ENUMDNE					0x00002000		//
#define	USB_OTG_GINTSTS_ISOODRP					0x00004000		//
#define	USB_OTG_GINTSTS_EOPF  					0x00008000		//
#define	USB_OTG_GINTSTS_IEPINT					0x00040000		//
#define	USB_OTG_GINTSTS_OEPINT					0x00080000		//
#define	USB_OTG_GINTSTS_IISOIXFR				0x00100000		//
#define	USB_OTG_GINTSTS_PXFR_INCOMPISOOUT		0x00200000		//
#define	USB_OTG_GINTSTS_DATAFSUSP				0x00400000		//
#define	USB_OTG_GINTSTS_HPRTINT					0x01000000		//
#define	USB_OTG_GINTSTS_HCINT 					0x02000000		//
#define	USB_OTG_GINTSTS_PTXFE 					0x04000000		//
#define	USB_OTG_GINTSTS_CIDSCHG					0x10000000		//
#define	USB_OTG_GINTSTS_DISCINT					0x20000000		//
#define	USB_OTG_GINTSTS_SRQINT					0x40000000		//
#define	USB_OTG_GINTSTS_WKUINT					0x80000000		//

// USB_OTG_GINTMSK register

#define	USB_OTG_GINTMSK_MMISM 					0x00000002		//
#define	USB_OTG_GINTMSK_OTGINT					0x00000004		//
#define	USB_OTG_GINTMSK_SOFM  					0x00000008		//
#define	USB_OTG_GINTMSK_RXFLVLM					0x00000010		//
#define	USB_OTG_GINTMSK_NPTXFEM					0x00000020		//
#define	USB_OTG_GINTMSK_GINAKEFFM				0x00000040		//
#define	USB_OTG_GINTMSK_GONAKEFFM				0x00000080		//
#define	USB_OTG_GINTMSK_ESUSPM					0x00000400		//
#define	USB_OTG_GINTMSK_USBSUSPM 				0x00000800		//
#define	USB_OTG_GINTMSK_USBRST					0x00001000		//
#define	USB_OTG_GINTMSK_ENUMDNEM 				0x00002000		//
#define	USB_OTG_GINTMSK_ISOODRPM 				0x00004000		//
#define	USB_OTG_GINTMSK_EOPFM 					0x00008000		//
#define	USB_OTG_GINTMSK_EPMISM					0x00020000		//
#define	USB_OTG_GINTMSK_IEPINT					0x00040000		//
#define	USB_OTG_GINTMSK_OEPINT					0x00080000		//
#define	USB_OTG_GINTMSK_IISOIXFRM				0x00100000		//
#define	USB_OTG_GINTMSK_PXFRM_IISOOXFRM			0x00200000		//
#define	USB_OTG_GINTMSK_FSUSPM					0x00400000		//
#define	USB_OTG_GINTMSK_PRTIM 					0x01000000		//
#define	USB_OTG_GINTMSK_HCIM  					0x02000000		//
#define	USB_OTG_GINTMSK_PTXFEM					0x04000000		//
#define	USB_OTG_GINTMSK_CIDSCHGM 				0x10000000		//
#define	USB_OTG_GINTMSK_DISCINT					0x20000000		//
#define	USB_OTG_GINTMSK_SRQIM 					0x40000000		//
#define	USB_OTG_GINTMSK_WUIM  					0x80000000		//

// USB_OTG_DAINT register

#define	USB_OTG_DAINT_IEPINT					0x0000FFFF		//
#define	USB_OTG_DAINT_OEPINT					0xFFFF0000		//

// USB_OTG_HAINTMSK register

#define	USB_OTG_HAINTMSK_HAINTM					0x0000FFFF		//

