galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F479/cpu_reg/stm32F479_usb.h
// USB_OTG_GRXSTSP register

#define	USB_OTG_GRXSTSP_EPNUM  					0x0000000F		//
#define	USB_OTG_GRXSTSP_BCNT   					0x00007FF0		//
#define	USB_OTG_GRXSTSP_DPID   					0x00018000		//
#define	USB_OTG_GRXSTSP_PKTSTS 					0x001E0000		//

// USB_OTG_DAINTMSK register

#define	USB_OTG_DAINTMSK_IEPM  					0x0000FFFF		//
#define	USB_OTG_DAINTMSK_OEPM  					0xFFFF0000		//

// USB_OTG register

#define	USB_OTG_CHNUM 							0x0000000F		//
#define	USB_OTG_CHNUM_0							0x00000001		//
#define	USB_OTG_CHNUM_1							0x00000002		//
#define	USB_OTG_CHNUM_2							0x00000004		//
#define	USB_OTG_CHNUM_3							0x00000008		//
#define	USB_OTG_BCNT  							0x00007FF0		//
#define	USB_OTG_DPID  							0x00018000		//
#define	USB_OTG_DPID_0							0x00008000		//
#define	USB_OTG_DPID_1							0x00010000		//
#define	USB_OTG_PKTSTS							0x001E0000		//
#define	USB_OTG_PKTSTS_0 						0x00020000		//
#define	USB_OTG_PKTSTS_1 						0x00040000		//
#define	USB_OTG_PKTSTS_2 						0x00080000		//
#define	USB_OTG_PKTSTS_3 						0x00100000		//
#define	USB_OTG_EPNUM 							0x0000000F		//
#define	USB_OTG_EPNUM_0							0x00000001		//
#define	USB_OTG_EPNUM_1							0x00000002		//
#define	USB_OTG_EPNUM_2							0x00000004		//
#define	USB_OTG_EPNUM_3							0x00000008		//
#define	USB_OTG_FRMNUM							0x01E00000		//
#define	USB_OTG_FRMNUM_0 						0x00200000		//
#define	USB_OTG_FRMNUM_1 						0x00400000		//
#define	USB_OTG_FRMNUM_2 						0x00800000		//
#define	USB_OTG_FRMNUM_3 						0x01000000		//
#define	USB_OTG_NPTXFSA							0x0000FFFF		//
#define	USB_OTG_NPTXFD							0xFFFF0000		//
#define	USB_OTG_TX0FSA							0x0000FFFF		//
#define	USB_OTG_TX0FD 							0xFFFF0000		//

// USB_OTG_GRXFSIZ register

#define	USB_OTG_GRXFSIZ_RXFD   					0x0000FFFF		//

// USB_OTG_DVBUSDIS register

#define	USB_OTG_DVBUSDIS_VBUSDT					0x0000FFFF		//

// USB_OTG_DVBUSPULSE register

#define	USB_OTG_DVBUSPULSE_DVBUSP				0x00000FFF		//

// USB_OTG_GNPTXSTS register

#define	USB_OTG_GNPTXSTS_NPTXFSAV 				0x0000FFFF		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV 				0x00FF0000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_0     		0x00010000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_1     		0x00020000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_2     		0x00040000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_3     		0x00080000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_4     		0x00100000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_5     		0x00200000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_6     		0x00400000		//
#define	USB_OTG_GNPTXSTS_NPTQXSAV_7     		0x00800000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP 				0x7F000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_0     		0x01000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_1     		0x02000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_2     		0x04000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_3     		0x08000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_4     		0x10000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_5     		0x20000000		//
#define	USB_OTG_GNPTXSTS_NPTXQTOP_6     		0x40000000		//

// USB_OTG_DTHRCTL register

#define	USB_OTG_DTHRCTL_NONISOTHREN    			0x00000001		//
#define	USB_OTG_DTHRCTL_ISOTHREN 				0x00000002		//
#define	USB_OTG_DTHRCTL_TXTHRLEN 				0x000007FC		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_0     			0x00000004		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_1     			0x00000008		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_2     			0x00000010		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_3     			0x00000020		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_4     			0x00000040		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_5     			0x00000080		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_6     			0x00000100		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_7     			0x00000200		//
#define	USB_OTG_DTHRCTL_TXTHRLEN_8     			0x00000400		//
#define	USB_OTG_DTHRCTL_RXTHREN					0x00010000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN 				0x03FE0000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_0     			0x00020000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_1     			0x00040000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_2     			0x00080000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_3     			0x00100000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_4     			0x00200000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_5     			0x00400000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_6     			0x00800000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_7     			0x01000000		//
#define	USB_OTG_DTHRCTL_RXTHRLEN_8     			0x02000000		//
#define	USB_OTG_DTHRCTL_ARPEN 					0x08000000		//

// USB_OTG_DIEPEMPMSK register

#define	USB_OTG_DIEPEMPMSK_INEPTXFEM			0x0000FFFF		//

// USB_OTG_DEACHINT register

#define	USB_OTG_DEACHINT_IEP1INT				0x00000002		//
#define	USB_OTG_DEACHINT_OEP1INT				0x00020000		//

// USB_OTG_GCCFG register

#define	USB_OTG_GCCFG_PWRDWN					0x00010000		//
#define	USB_OTG_GCCFG_I2CPADEN 					0x00020000		//
#define	USB_OTG_GCCFG_VBUSASEN 					0x00040000		//
#define	USB_OTG_GCCFG_VBUSBSEN 					0x00080000		//
#define	USB_OTG_GCCFG_SOFOUTEN 					0x00100000		//
#define	USB_OTG_GCCFG_NOVBUSSENS     			0x00200000		//

// USB_OTG_DEACHINTMSK register

#define	USB_OTG_DEACHINTMSK_IEP1INTM 			0x00000002		//
#define	USB_OTG_DEACHINTMSK_OEP1INTM 			0x00020000		//

// USB_OTG_CID register

#define	USB_OTG_CID_PRODUCT_ID     				0xFFFFFFFF		//

// USB_OTG_DIEPEACHMSK1 register

#define	USB_OTG_DIEPEACHMSK1_XFRCM 				0x00000001		//
#define	USB_OTG_DIEPEACHMSK1_EPDM  				0x00000002		//
#define	USB_OTG_DIEPEACHMSK1_TOM   				0x00000008		//
#define	USB_OTG_DIEPEACHMSK1_ITTXFEMSK			0x00000010		//
#define	USB_OTG_DIEPEACHMSK1_INEPNMM			0x00000020		//
#define	USB_OTG_DIEPEACHMSK1_INEPNEM			0x00000040		//
#define	USB_OTG_DIEPEACHMSK1_TXFURM				0x00000100		//
#define	USB_OTG_DIEPEACHMSK1_BIM   				0x00000200		//
#define	USB_OTG_DIEPEACHMSK1_NAKM  				0x00002000		//

// USB_OTG_HPRT register

#define	USB_OTG_HPRT_PCSTS 						0x00000001		//
#define	USB_OTG_HPRT_PCDET 						0x00000002		//
#define	USB_OTG_HPRT_PENA  						0x00000004		//
#define	USB_OTG_HPRT_PENCHNG					0x00000008		//
#define	USB_OTG_HPRT_POCA  						0x00000010		//
#define	USB_OTG_HPRT_POCCHNG					0x00000020		//
#define	USB_OTG_HPRT_PRES  						0x00000040		//
#define	USB_OTG_HPRT_PSUSP 						0x00000080		//
#define	USB_OTG_HPRT_PRST  						0x00000100		//
#define	USB_OTG_HPRT_PLSTS 						0x00000C00		//
#define	USB_OTG_HPRT_PLSTS_0					0x00000400		//
#define	USB_OTG_HPRT_PLSTS_1					0x00000800		//
#define	USB_OTG_HPRT_PPWR  						0x00001000		//
#define	USB_OTG_HPRT_PTCTL 						0x0001E000		//
#define	USB_OTG_HPRT_PTCTL_0					0x00002000		//
#define	USB_OTG_HPRT_PTCTL_1					0x00004000		//
#define	USB_OTG_HPRT_PTCTL_2					0x00008000		//
#define	USB_OTG_HPRT_PTCTL_3					0x00010000		//
#define	USB_OTG_HPRT_PSPD  						0x00060000		//
#define	USB_OTG_HPRT_PSPD_0						0x00020000		//
#define	USB_OTG_HPRT_PSPD_1						0x00040000		//

// USB_OTG_DOEPEACHMSK1 register

#define	USB_OTG_DOEPEACHMSK1_XFRCM 				0x00000001		//
#define	USB_OTG_DOEPEACHMSK1_EPDM  				0x00000002		//
#define	USB_OTG_DOEPEACHMSK1_TOM   				0x00000008		//
#define	USB_OTG_DOEPEACHMSK1_ITTXFEMSK			0x00000010		//
#define	USB_OTG_DOEPEACHMSK1_INEPNMM			0x00000020		//
#define	USB_OTG_DOEPEACHMSK1_INEPNEM			0x00000040		//
#define	USB_OTG_DOEPEACHMSK1_TXFURM				0x00000100		//
#define	USB_OTG_DOEPEACHMSK1_BIM   				0x00000200		//
#define	USB_OTG_DOEPEACHMSK1_BERRM 				0x00001000		//
#define	USB_OTG_DOEPEACHMSK1_NAKM  				0x00002000		//
#define	USB_OTG_DOEPEACHMSK1_NYETM 				0x00004000		//

// USB_OTG_HPTXFSIZ register

#define	USB_OTG_HPTXFSIZ_PTXSA 					0x0000FFFF		//
#define	USB_OTG_HPTXFSIZ_PTXFD 					0xFFFF0000		//

