galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F479/cpu_reg/stm32F479_usb.h
// USB_OTG_DIEPCTL register

#define	USB_OTG_DIEPCTL_MPSIZ 					0x000007FF		//
#define	USB_OTG_DIEPCTL_USBAEP					0x00008000		//
#define	USB_OTG_DIEPCTL_EONUM_DPID     			0x00010000		//
#define	USB_OTG_DIEPCTL_NAKSTS					0x00020000		//
#define	USB_OTG_DIEPCTL_EPTYP 					0x000C0000		//
#define	USB_OTG_DIEPCTL_EPTYP_0					0x00040000		//
#define	USB_OTG_DIEPCTL_EPTYP_1					0x00080000		//
#define	USB_OTG_DIEPCTL_STALL 					0x00200000		//
#define	USB_OTG_DIEPCTL_TXFNUM					0x03C00000		//
#define	USB_OTG_DIEPCTL_TXFNUM_0 				0x00400000		//
#define	USB_OTG_DIEPCTL_TXFNUM_1 				0x00800000		//
#define	USB_OTG_DIEPCTL_TXFNUM_2 				0x01000000		//
#define	USB_OTG_DIEPCTL_TXFNUM_3 				0x02000000		//
#define	USB_OTG_DIEPCTL_CNAK  					0x04000000		//
#define	USB_OTG_DIEPCTL_SNAK  					0x08000000		//
#define	USB_OTG_DIEPCTL_SD0PID_SEVNFRM 			0x10000000		//
#define	USB_OTG_DIEPCTL_SODDFRM					0x20000000		//
#define	USB_OTG_DIEPCTL_EPDIS 					0x40000000		//
#define	USB_OTG_DIEPCTL_EPENA 					0x80000000		//

// USB_OTG_HCCHAR register

#define	USB_OTG_HCCHAR_MPSIZ 					0x000007FF		//
#define	USB_OTG_HCCHAR_EPNUM 					0x00007800		//
#define	USB_OTG_HCCHAR_EPNUM_0					0x00000800		//
#define	USB_OTG_HCCHAR_EPNUM_1					0x00001000		//
#define	USB_OTG_HCCHAR_EPNUM_2					0x00002000		//
#define	USB_OTG_HCCHAR_EPNUM_3					0x00004000		//
#define	USB_OTG_HCCHAR_EPDIR 					0x00008000		//
#define	USB_OTG_HCCHAR_LSDEV 					0x00020000		//
#define	USB_OTG_HCCHAR_EPTYP 					0x000C0000		//
#define	USB_OTG_HCCHAR_EPTYP_0					0x00040000		//
#define	USB_OTG_HCCHAR_EPTYP_1					0x00080000		//
#define	USB_OTG_HCCHAR_MC    					0x00300000		//
#define	USB_OTG_HCCHAR_MC_0  					0x00100000		//
#define	USB_OTG_HCCHAR_MC_1  					0x00200000		//
#define	USB_OTG_HCCHAR_DAD   					0x1FC00000		//
#define	USB_OTG_HCCHAR_DAD_0 					0x00400000		//
#define	USB_OTG_HCCHAR_DAD_1 					0x00800000		//
#define	USB_OTG_HCCHAR_DAD_2 					0x01000000		//
#define	USB_OTG_HCCHAR_DAD_3 					0x02000000		//
#define	USB_OTG_HCCHAR_DAD_4 					0x04000000		//
#define	USB_OTG_HCCHAR_DAD_5 					0x08000000		//
#define	USB_OTG_HCCHAR_DAD_6 					0x10000000		//
#define	USB_OTG_HCCHAR_ODDFRM					0x20000000		//
#define	USB_OTG_HCCHAR_CHDIS 					0x40000000		//
#define	USB_OTG_HCCHAR_CHENA 					0x80000000		//

// USB_OTG_HCSPLT register

#define	USB_OTG_HCSPLT_PRTADDR					0x0000007F		//
#define	USB_OTG_HCSPLT_PRTADDR_0				0x00000001		//
#define	USB_OTG_HCSPLT_PRTADDR_1				0x00000002		//
#define	USB_OTG_HCSPLT_PRTADDR_2				0x00000004		//
#define	USB_OTG_HCSPLT_PRTADDR_3				0x00000008		//
#define	USB_OTG_HCSPLT_PRTADDR_4				0x00000010		//
#define	USB_OTG_HCSPLT_PRTADDR_5				0x00000020		//
#define	USB_OTG_HCSPLT_PRTADDR_6				0x00000040		//
#define	USB_OTG_HCSPLT_HUBADDR					0x00003F80		//
#define	USB_OTG_HCSPLT_HUBADDR_0				0x00000080		//
#define	USB_OTG_HCSPLT_HUBADDR_1				0x00000100		//
#define	USB_OTG_HCSPLT_HUBADDR_2				0x00000200		//
#define	USB_OTG_HCSPLT_HUBADDR_3				0x00000400		//
#define	USB_OTG_HCSPLT_HUBADDR_4				0x00000800		//
#define	USB_OTG_HCSPLT_HUBADDR_5				0x00001000		//
#define	USB_OTG_HCSPLT_HUBADDR_6				0x00002000		//
#define	USB_OTG_HCSPLT_XACTPOS					0x0000C000		//
#define	USB_OTG_HCSPLT_XACTPOS_0				0x00004000		//
#define	USB_OTG_HCSPLT_XACTPOS_1				0x00008000		//
#define	USB_OTG_HCSPLT_COMPLSPLT				0x00010000		//
#define	USB_OTG_HCSPLT_SPLITEN					0x80000000		//

// USB_OTG_HCINT register

#define	USB_OTG_HCINT_XFRC  					0x00000001		//
#define	USB_OTG_HCINT_CHH   					0x00000002		//
#define	USB_OTG_HCINT_AHBERR					0x00000004		//
#define	USB_OTG_HCINT_STALL 					0x00000008		//
#define	USB_OTG_HCINT_NAK   					0x00000010		//
#define	USB_OTG_HCINT_ACK   					0x00000020		//
#define	USB_OTG_HCINT_NYET  					0x00000040		//
#define	USB_OTG_HCINT_TXERR 					0x00000080		//
#define	USB_OTG_HCINT_BBERR 					0x00000100		//
#define	USB_OTG_HCINT_FRMOR 					0x00000200		//
#define	USB_OTG_HCINT_DTERR 					0x00000400		//

// USB_OTG_DIEPINT register

#define	USB_OTG_DIEPINT_XFRC  					0x00000001		//
#define	USB_OTG_DIEPINT_EPDISD					0x00000002		//
#define	USB_OTG_DIEPINT_TOC   					0x00000008		//
#define	USB_OTG_DIEPINT_ITTXFE					0x00000010		//
#define	USB_OTG_DIEPINT_INEPNE					0x00000040		//
#define	USB_OTG_DIEPINT_TXFE  					0x00000080		//
#define	USB_OTG_DIEPINT_TXFIFOUDRN     			0x00000100		//
#define	USB_OTG_DIEPINT_BNA   					0x00000200		//
#define	USB_OTG_DIEPINT_PKTDRPSTS				0x00000800		//
#define	USB_OTG_DIEPINT_BERR  					0x00001000		//
#define	USB_OTG_DIEPINT_NAK   					0x00002000		//

// USB_OTG_HCINTMSK register

#define	USB_OTG_HCINTMSK_XFRCM 					0x00000001		//
#define	USB_OTG_HCINTMSK_CHHM  					0x00000002		//
#define	USB_OTG_HCINTMSK_AHBERR					0x00000004		//
#define	USB_OTG_HCINTMSK_STALLM					0x00000008		//
#define	USB_OTG_HCINTMSK_NAKM  					0x00000010		//
#define	USB_OTG_HCINTMSK_ACKM  					0x00000020		//
#define	USB_OTG_HCINTMSK_NYET  					0x00000040		//
#define	USB_OTG_HCINTMSK_TXERRM					0x00000080		//
#define	USB_OTG_HCINTMSK_BBERRM					0x00000100		//
#define	USB_OTG_HCINTMSK_FRMORM					0x00000200		//
#define	USB_OTG_HCINTMSK_DTERRM					0x00000400		//

// USB_OTG_DIEPTSIZ register

#define	USB_OTG_DIEPTSIZ_XFRSIZ					0x0007FFFF		//
#define	USB_OTG_DIEPTSIZ_PKTCNT					0x1FF80000		//
#define	USB_OTG_DIEPTSIZ_MULCNT					0x60000000		//

// USB_OTG_HCTSIZ register

#define	USB_OTG_HCTSIZ_XFRSIZ  					0x0007FFFF		//
#define	USB_OTG_HCTSIZ_PKTCNT  					0x1FF80000		//
#define	USB_OTG_HCTSIZ_DOPING  					0x80000000		//
#define	USB_OTG_HCTSIZ_DPID    					0x60000000		//
#define	USB_OTG_HCTSIZ_DPID_0  					0x20000000		//
#define	USB_OTG_HCTSIZ_DPID_1  					0x40000000		//

// USB_OTG_DIEPDMA register

#define	USB_OTG_DIEPDMA_DMAADDR					0xFFFFFFFF		//

// USB_OTG_HCDMA register

#define	USB_OTG_HCDMA_DMAADDR  					0xFFFFFFFF		//

// USB_OTG_DTXFSTS register

#define	USB_OTG_DTXFSTS_INEPTFSAV 				0x0000FFFF		//

// USB_OTG_DIEPTXF register

#define	USB_OTG_DIEPTXF_INEPTXSA				0x0000FFFF		//
#define	USB_OTG_DIEPTXF_INEPTXFD				0xFFFF0000		//

// USB_OTG_DOEPCTL register

#define	USB_OTG_DOEPCTL_MPSIZ   				0x000007FF		//
#define	USB_OTG_DOEPCTL_USBAEP  				0x00008000		//
#define	USB_OTG_DOEPCTL_NAKSTS  				0x00020000		//
#define	USB_OTG_DOEPCTL_SD0PID_SEVNFRM   		0x10000000		//
#define	USB_OTG_DOEPCTL_SODDFRM 				0x20000000		//
#define	USB_OTG_DOEPCTL_EPTYP   				0x000C0000		//
#define	USB_OTG_DOEPCTL_EPTYP_0 				0x00040000		//
#define	USB_OTG_DOEPCTL_EPTYP_1 				0x00080000		//
#define	USB_OTG_DOEPCTL_SNPM    				0x00100000		//
#define	USB_OTG_DOEPCTL_STALL   				0x00200000		//
#define	USB_OTG_DOEPCTL_CNAK    				0x04000000		//
#define	USB_OTG_DOEPCTL_SNAK    				0x08000000		//
#define	USB_OTG_DOEPCTL_EPDIS   				0x40000000		//
#define	USB_OTG_DOEPCTL_EPENA   				0x80000000		//

// USB_OTG_DOEPINT register
#define	USB_OTG_DOEPINT_XFRC  					0x00000001		//
#define	USB_OTG_DOEPINT_EPDISD					0x00000002		//
#define	USB_OTG_DOEPINT_STUP  					0x00000008		//
#define	USB_OTG_DOEPINT_OTEPDIS					0x00000010		//
#define	USB_OTG_DOEPINT_B2BSTUP					0x00000040		//
#define	USB_OTG_DOEPINT_NYET  					0x00004000		//

// USB_OTG_DOEPTSIZ register

#define	USB_OTG_DOEPTSIZ_XFRSIZ					0x0007FFFF		//
#define	USB_OTG_DOEPTSIZ_PKTCNT					0x1FF80000		//
#define	USB_OTG_DOEPTSIZ_STUPCNT				0x60000000		//
#define	USB_OTG_DOEPTSIZ_STUPCNT_0				0x20000000		//
#define	USB_OTG_DOEPTSIZ_STUPCNT_1				0x40000000		//

// USB_OTG_PCGCCTL register

#define	USB_OTG_PCGCCTL_STOPCLK					0x00000001		//
#define	USB_OTG_PCGCCTL_GATECLK					0x00000002		//
#define	USB_OTG_PCGCCTL_PHYSUSP					0x00000010		//
#endif
